<a href="https://colab.research.google.com/github/NDSUKESH/Atliq-Hardwares-SQL-PROJECT/blob/main/sql_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3

In [2]:
conn=sqlite3.connect("data.db")

In [3]:
conn.execute('''CREATE TABLE employees (
  id INT PRIMARY KEY,
  name VARCHAR(50),
  age INT,
  department VARCHAR(50),
  salary INT
);''')
conn.commit()

In [4]:
conn.execute('''INSERT INTO employees (id, name, age, department, salary)
VALUES
  (1, 'Alice', 25, 'Sales', 50000),
  (2, 'Bob', 30, 'Marketing', 60000),
  (3, 'Charlie', 35, 'Sales', 70000),
  (4, 'Dave', 40, 'Finance', 80000),
  (5, 'Emma', 45, 'Marketing', 90000),
  (6, 'Frank', 50, 'Finance', 100000);''')
conn.commit()

In [5]:
a=conn.execute("select * from employees")

In [6]:
for i in a:
  print(i)

(1, 'Alice', 25, 'Sales', 50000)
(2, 'Bob', 30, 'Marketing', 60000)
(3, 'Charlie', 35, 'Sales', 70000)
(4, 'Dave', 40, 'Finance', 80000)
(5, 'Emma', 45, 'Marketing', 90000)
(6, 'Frank', 50, 'Finance', 100000)

1.How many employees are there in each department?

In [7]:
a=conn.execute("select department,count(*) from employees group by department")
for r in a:
  print(r)

('Finance', 2)
('Marketing', 2)
('Sales', 2)

2.What is the average salary of employees in the Sales department?

In [15]:
a=conn.execute("select avg(salary) from employees where department='Sales';")

In [16]:
for i in a:
  print(i)

(60000.0,)

3.Which department has the highest total salary?

In [18]:
a=conn.execute("select department,avg(salary) as avgs from employees group by department order by avgs desc limit 1;")
for i in a:
  print(i)

('Finance', 90000.0)

4.What is the total salary of all employees under 35 years old?

In [19]:
a=conn.execute("select avg(salary) from employees where age >35;")
for i in a:
  print(i)

(90000.0,)

5.What is the name of the oldest employee?

In [22]:
a=conn.execute("select name from employees order by age desc limit 1;")
for i in a:
  print(i)

('Frank',)

6.What is the highest salary of employees under 40 years old?

In [23]:
a=conn.execute("select name,salary from employees where age < 40 order by salary desc limit 1;")
for i in a:
  print(i)

('Charlie', 70000)

7.What is the average age of employees in the Marketing department?

In [24]:
a=conn.execute("select avg(age) from employees where department='Marketing';")
for i in a:
  print(i)

(37.5,)

8.Which department has the fewest employees?

In [28]:
a=conn.execute("select department,count(*) as c from employees group by department order by c;")
for i in a:
  print(i)

('Finance', 2)
('Marketing', 2)
('Sales', 2)

9.What is the total salary of employees whose name starts with 'A'?

In [30]:
a=conn.execute("select sum(salary) from employees where name like 'A%';")
for i in a:
  print(i)

(50000,)

10.Which employees have a salary greater than the average salary of their department?

In [35]:
a=conn.execute('''SELECT id, name, department, salary
FROM employees
WHERE salary > (
  SELECT AVG(salary)
  FROM employees e2
  WHERE e2.department = employees.department);''')

In [36]:
for i in a:
  print(i)

(3, 'Charlie', 'Sales', 70000)
(5, 'Emma', 'Marketing', 90000)
(6, 'Frank', 'Finance', 100000)